content/imported/tutorials/partitioned-backwards-facing-step/fluid1-openfoam/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    fixedWalls
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }

    cplOutlet
    {
        type            coupledPressure;
        refValue        uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}
