content/imported/tutorials/partitioned-backwards-facing-step/fluid1-openfoam/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          1e-4;
        minIter         2;
    }

    UFinal
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors 2;
    nNonOrthogonalCorrectors 0;
    momentumPredictor true; 
    nOuterCorrectors	2;
}
