content/imported/tutorials/partitioned-backwards-facing-step/fluid1-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid1;

modules (FF);

interfaces
{
  Interface1
  {
    mesh              Fluid1-Mesh;
    patches           (cplOutlet);
    
    readData
    (
      Pressure
      VelocityBack
      VelocityGradient
    );
    
    writeData
    (
      Velocity
      PressureBack
      VelocityGradientBack
    );
  };
};